Revit 2027 API
SpaceType Enumeration
An enumerated type listing all the possible space types for a space object.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SpaceType
Public Enumeration SpaceType
public enum class SpaceType
type SpaceType
Members
Member name | Value | Description
kActiveStorage | 0 | Space Type is ActiveStorage.
kActiveStorageHospitalOrHealthcare | 1 | Space Type is ActiveStorageHospitalOrHealthcare.
kAirOrTrainOrBusBaggageArea | 2 | Space Type is AirOrTrainOrBusBaggageArea.
kAirportConcourse | 3 | Space Type is AirportConcourse.
kAtriumEachAdditionalFloor | 4 | Space Type is AtriumEachAdditionalFloor.
kAtriumFirstThreeFloors | 5 | Space Type is AtriumFirstThreeFloors.
kAudienceOrSeatingAreaAuditorium | 16 | Space Type is AudienceOrSeatingAreaAuditorium.
kAudienceOrSeatingAreaConventionCenter | 10 | Space Type is AudienceOrSeatingAreaConventionCenter.
kAudienceOrSeatingAreaCourtHouse | 15 | Space Type is AudienceOrSeatingAreaCourtHouse.
kAudienceOrSeatingAreaExerciseCenter | 7 | Space Type is AudienceOrSeatingAreaExerciseCenter.
kAudienceOrSeatingAreaGymnasium | 8 | Space Type is AudienceOrSeatingAreaGymnasium.
kAudienceOrSeatingAreaMotionPictureTheatre | 11 | Space Type is AudienceOrSeatingAreaMotionPictureTheatre.
kAudienceOrSeatingAreaPenitentiary | 6 | Space Type is AudienceOrSeatingAreaPenitentiary.
kAudienceOrSeatingAreaPerformingArtsTheatre | 12 | Space Type is AudienceOrSeatingAreaPerformingArtsTheatre.
kAudienceOrSeatingAreaPoliceOrFireStations | 14 | Space Type is AudienceOrSeatingAreaPoliceOrFireStations.
kAudienceOrSeatingAreaReligious | 13 | Space Type is AudienceOrSeatingAreaReligious.
kAudienceOrSeatingAreaSportsArena | 9 | Space Type is AudienceOrSeatingAreaSportsArena.
kBankCustomerArea | 17 | Space Type is BankCustomerArea.
kBankingActivityAreaOffice | 18 | Space Type is BankingActivityAreaOffice.
kBarberAndBeautyParlor | 19 | Space Type is BarberAndBeautyParlor.
kCardFileAndCataloguingLibrary | 20 | Space Type is CardFileAndCataloguingLibrary.
kClassroomOrLectureOrTraining | 22 | Space Type is ClassroomOrLectureOrTraining.
kClassroomOrLectureOrTrainingPenitentiary | 21 | Space Type is ClassroomOrLectureOrTrainingPenitentiary.
kConferenceMeetingOrMultipurpose | 25 | Space Type is ConferenceMeetingOrMultipurpose.
kConfinementCellsCourtHouse | 24 | Space Type is ConfinementCellsCourtHouse.
kConfinementCellsPenitentiary | 23 | Space Type is ConfinementCellsPenitentiary.
kCorridorOrTransition | 26 | Space Type is CorridorOrTransition.
kCorridorOrTransitionManufacturingFacility | 27 | Space Type is CorridorOrTransitionManufacturingFacility.
kCorridorsWithPatientWaitingExamHospitalOrHealthcare | 28 | Space Type is CorridorsWithPatientWaitingExamHospitalOrHealthcare.
kCourtroomCourtHouse | 30 | Space Type is CourtroomCourtHouse.
kCourtSportsAreaSportsArena | 29 | Space Type is CourtSportsAreaSportsArena.
kDepartmentStoreSalesAreaRetail | 31 | Space Type is DepartmentStoreSalesAreaRetail.
kDetailedManufacturingFacility | 32 | Space Type is DetailedManufacturingFacility.
kDiningArea | 33 | Space Type is DiningArea.
kDiningAreaCivilServices | 40 | Space Type is DiningAreaCivilServices.
kDiningAreaFamilyDining | 35 | Space Type is DiningAreaFamilyDining.
kDiningAreaHotel | 34 | Space Type is DiningAreaHotel.
kDiningAreaLoungeOrLeisureDining | 36 | Space Type is DiningAreaLoungeOrLeisureDining.
kDiningAreaMotel | 37 | Space Type is DiningAreaMotel.
kDiningAreaPenitentiary | 39 | Space Type is DiningAreaPenitentiary.
kDiningAreaTransportation | 38 | Space Type is DiningAreaTransportation.
kDormitoryBedroom | 41 | Space Type is DormitoryBedroom.
kDormitoryStudyHall | 42 | Space Type is DormitoryStudyHall.
kDressingOrLockerOrFittingRoomAuditorium | 46 | Space Type is DressingOrLockerOrFittingRoomAuditorium.
kDressingOrLockerOrFittingRoomCourtHouse | 44 | Space Type is DressingOrLockerOrFittingRoomCourtHouse.
kDressingOrLockerOrFittingRoomExerciseCenter | 47 | Space Type is DressingOrLockerOrFittingRoomExerciseCenter.
kDressingOrLockerOrFittingRoomGymnasium | 43 | Space Type is DressingOrLockerOrFittingRoomGymnasium.
kDressingOrLockerOrFittingRoomPerformingArtsTheatre | 45 | Space Type is DressingOrLockerOrFittingRoomPerformingArtsTheatre.
kElectricalOrMechanical | 48 | Space Type is ElectricalOrMechanical.
kElevatorLobbies | 49 | Space Type is ElevatorLobbies.
kEmergencyHospitalOrHealthcare | 50 | Space Type is EmergencyHospitalOrHealthcare.
kEquipmentRoomManufacturingFacility | 51 | Space Type is EquipmentRoomManufacturingFacility.
kExamOrTreatmentHospitalOrHealthcare | 52 | Space Type is ExamOrTreatmentHospitalOrHealthcare.
kExerciseAreaExerciseCenter | 53 | Space Type is ExerciseAreaExerciseCenter.
kExerciseAreaGymnasium | 54 | Space Type is ExerciseAreaGymnasium.
kExhibitSpaceConventionCenter | 55 | Space Type is ExhibitSpaceConventionCenter.
kFellowshipHallReligiousBuildings | 56 | Space Type is FellowshipHallReligiousBuildings.
kFineMaterialWarehouse | 57 | Space Type is FineMaterialWarehouse.
kFineMerchandiseSalesAreaRetail | 58 | Space Type is FineMerchandiseSalesAreaRetail.
kFireStationEngineRoomPoliceOrFireStation | 59 | Space Type is FireStationEngineRoomPoliceOrFireStation.
kFoodPreparation | 60 | Space Type is FoodPreparation.
kGarageServiceOrRepairAutomotiveFacility | 61 | Space Type is GarageServiceOrRepairAutomotiveFacility.
kGeneralExhibitionMuseum | 64 | Space Type is GeneralExhibitionMuseum.
kGeneralHighBayManufacturingFacility | 62 | Space Type is GeneralHighBayManufacturingFacility.
kGeneralLowBayManufacturingFacility | 63 | Space Type is GeneralLowBayManufacturingFacility.
kHospitalNurseryHospitalOrHealthcare | 65 | Space Type is HospitalNurseryHospitalOrHealthcare.
kHospitalOrMedicalSuppliesHospitalOrHealthcare | 66 | Space Type is HospitalOrMedicalSuppliesHospitalOrHealthcare.
kHospitalOrRadiologyHospitalOrHealthcare | 67 | Space Type is HospitalOrRadiologyHospitalOrHealthcare.
kHotelOrConferenceCenterConferenceOrMeeting | 68 | Space Type is HotelOrConferenceCenterConferenceOrMeeting.
kInactiveStorage | 69 | Space Type is InactiveStorage.
kJudgesChambersCourtHouse | 70 | Space Type is JudgesChambersCourtHouse.
kLaboratoryOffice | 71 | Space Type is LaboratoryOffice.
kLaundryIroningAndSorting | 72 | Space Type is LaundryIroningAndSorting.
kLaundryWashingHospitalOrHealthcare | 73 | Space Type is LaundryWashingHospitalOrHealthcare.
kLibraryAudioVisualLibraryAudioVisual | 74 | Space Type is LibraryAudioVisualLibraryAudioVisual.
kLivingQuartersDormitory | 75 | Space Type is LivingQuartersDormitory.
kLivingQuartersHotel | 77 | Space Type is LivingQuartersHotel.
kLivingQuartersMotel | 76 | Space Type is LivingQuartersMotel.
kLobby | 78 | Space Type is Lobby.
kLobbyAuditorium | 81 | Space Type is LobbyAuditorium.
kLobbyHotel | 84 | Space Type is LobbyHotel.
kLobbyMotionPictureTheatre | 80 | Space Type is LobbyMotionPictureTheatre.
kLobbyPerformingArtsTheatre | 82 | Space Type is LobbyPerformingArtsTheatre.
kLobbyPostOffice | 83 | Space Type is LobbyPostOffice.
kLobbyReligiousBuildings | 79 | Space Type is LobbyReligiousBuildings.
kLoungeOrRecreation | 85 | Space Type is LoungeOrRecreation.
kMallConcourseSalesAreaRetail | 86 | Space Type is MallConcourseSalesAreaRetail.
kMassMerchandisingSalesAreaRetail | 87 | Space Type is MassMerchandisingSalesAreaRetail.
kMediumOrBulkyMaterialWarehouse | 88 | Space Type is MediumOrBulkyMaterialWarehouse.
kMerchandisingSalesAreaRetail | 89 | Space Type is MerchandisingSalesAreaRetail.
kMuseumAndGalleryStorage | 90 | Space Type is MuseumAndGalleryStorage.
kNoOfSpaceTypes | 126 | Space Type is NoOfSpaceTypes.
kNurseStationHospitalOrHealthcare | 91 | Space Type is NurseStationHospitalOrHealthcare.
kOfficeCommonActivityAreasInactiveStorage | 94 | Space Type is OfficeCommonActivityAreasInactiveStorage.
kOfficeEnclosed | 92 | Space Type is OfficeEnclosed.
kOfficeOpenPlan | 93 | Space Type is OfficeOpenPlan.
kOperatingRoomHospitalOrHealthcare | 95 | Space Type is OperatingRoomHospitalOrHealthcare.
kOtherTelevisedPlayingAreaSportsArena | 96 | Space Type is OtherTelevisedPlayingAreaSportsArena.
kParkingAreaAttendantOnlyParkingGarage | 97 | Space Type is ParkingAreaAttendantOnlyParkingGarage.
kParkingAreaPedestrianParkingGarage | 98 | Space Type is ParkingAreaPedestrianParkingGarage.
kPatientRoomHospitalOrHealthcare | 99 | Space Type is PatientRoomHospitalOrHealthcare.
kPersonalServicesSalesAreaRetail | 100 | Space Type is PersonalServicesSalesAreaRetail.
kPharmacyHospitalOrHealthcare | 101 | Space Type is PharmacyHospitalOrHealthcare.
kPhysicalTherapyHospitalOrHealthcare | 102 | Space Type is PhysicalTherapyHospitalOrHealthcare.
kPlayingAreaGymnasium | 103 | Space Type is PlayingAreaGymnasium.
kPlenum | 104 | Space Type is Plenum.
kPoliceStationLaboratoryPoliceOrFireStations | 105 | Space Type is PoliceStationLaboratoryPoliceOrFireStations.
kPublicAndStaffLoungeHospitalOrHealthcare | 106 | Space Type is PublicAndStaffLoungeHospitalOrHealthcare.
kReadingAreaLibrary | 107 | Space Type is ReadingAreaLibrary.
kReceptionOrWaitingHotel | 110 | Space Type is ReceptionOrWaitingHotel.
kReceptionOrWaitingMotel | 109 | Space Type is ReceptionOrWaitingMotel.
kReceptionOrWaitingTransportation | 108 | Space Type is ReceptionOrWaitingTransportation.
kRecoveryHospitalOrHealthcare | 111 | Space Type is RecoveryHospitalOrHealthcare.
kRestorationMuseum | 112 | Space Type is RestorationMuseum.
kRestrooms | 113 | Space Type is Restrooms.
kRingSportsAreaSportsArena | 114 | Space Type is RingSportsAreaSportsArena.
kSleepingQuartersPoliceOrFireStation | 116 | Space Type is SleepingQuartersPoliceOrFireStation.
kSortingAreaPostOffice | 117 | Space Type is SortingAreaPostOffice.
kSpecialtyStoreSalesAreaRetail | 118 | Space Type is SpecialtyStoreSalesAreaRetail.
kStacksLibrary | 119 | Space Type is StacksLibrary.
kStairsInactive | 120 | Space Type is StairsInactive.
kStairway | 121 | Space Type is Stairway.
kSupermarketSalesAreaRetail | 122 | Space Type is SupermarketSalesAreaRetail.
kTerminalTicketCounterTransportation | 123 | Space Type is TerminalTicketCounterTransportation.
kWorkshopWorkshop | 124 | Space Type is WorkshopWorkshop.
kWorshipPulpitChoirReligious | 125 | Space Type is WorshipPulpitChoirReligious.
NoSpaceType | -1 | Space Type is NoSpaceType.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace